# 4.9. Data visualization, part 1
#

# Table of contents:
## 1. Import libraries
## 2. Import customers dataset
## 3. Data wrangling
### 3.1. Rename columns
### 3.2. Check data types
### 3.3. Descriptive statistics
## 4. Data quality and consistency checks
### 4.1. Check missing values
### 4.2. Check columns for mixed-type data
### 4.3. Check for duplicate values
## 5. Combine customers data with orders_products_flagged data
## 6. Export merged dataframe as 'orders_products_customers_merged.pkl'
#

## 1. Import libraries

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os

## 2. Import customers dataset

In [3]:
# Create a path variable
path = r'C:\Users\marta\OneDrive\Documents\2023-09-18 Instacart Basket Analysis'

In [4]:
# Import 'customers' dataset as df_customers
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [5]:
# Check the output
df_customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [6]:
# Check the dimensions
df_customers.shape

(206209, 10)

## 3. Data wrangling

### 3.1. Rename columns

In [7]:
# Rename columns 'First Name', 'Surnam', 'Gender', 'STATE', 'Age'
df_customers.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age': 'age'}, inplace = True)

In [8]:
# Check the output
df_customers.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

### 3.2. Check data types

In [9]:
# Check columns information
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   first_name    194950 non-null  object
 2   last_name     206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

#### 'first_name' column seems to have missing values. 'user_id' column type should be changed from integer to string to exclude this column from descriptive analysis.

In [10]:
# Change data type for 'user_id' from 'int64' to 'string'
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [11]:
# Check the output
df_customers['user_id'].dtype

dtype('O')

### 3.3. Descriptive statistics

In [12]:
# Descriptive statistics for df_customers
df_customers.describe().round(2)

             age  n_dependants     income
count  206209.00     206209.00  206209.00
mean       49.50          1.50   94632.85
std        18.48          1.12   42473.79
min        18.00          0.00   25903.00
25%        33.00          0.00   59874.00
50%        49.00          1.00   93547.00
75%        66.00          3.00  124244.00
max        81.00          3.00  593901.00

#### All values look realistic and logical.

## 4. Data quality and consistency checks

### 4.1. Check missing values

In [13]:
# Check missing values
df_customers.isnull().sum()

user_id             0
first_name      11259
last_name           0
gender              0
state               0
age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

There are 11,259 missing values within 'first_name'.

In [14]:
# Display rows with missing values
df_customers.loc[df_customers['first_name'].isnull()]

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [15]:
# Impute missing values within 'first_name' column with 'Unknown'
df_customers['first_name'].fillna('Unknown', inplace=True)

In [16]:
# Check the result
df_customers['first_name'].isnull().sum()

0

### 4.2. Check columns for mixed-type data

In [17]:
# Check for mixed-type columns
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

There are no columns with mixed-type data.

### 4.3. Check for duplicate values

In [18]:
# Create a subset dataframe with only duplicated values
df_dups = df_customers[df_customers.duplicated()]

In [19]:
# Check the output
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

No duplicated rows were found.

## 5. Combine customers data with orders_products_flagged data

### -- Import orders_products_flagged dataset

In [20]:
# Import ords_prods_flag dataset
ords_prods_flag = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_flagged.pkl'))

In [21]:
# Check the shape 
ords_prods_flag.shape

(32399732, 24)

In [22]:
# Check the first five rows
ords_prods_flag.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price,spending_flag,median_order_day,order_freq_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Mid-range product,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Mid-range product,Least busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [23]:
# Check data type of 'user_id'
ords_prods_flag['user_id'].dtype

dtype('int64')

In [24]:
# Change data type for 'user_id' from 'int64' to 'string'
ords_prods_flag['user_id'] = ords_prods_flag['user_id'].astype('str')

In [25]:
# Check the result
ords_prods_flag['user_id'].dtype

dtype('O')

### -- Merge two dataframes

In [26]:
# Merge df_customers with ords_prods_flag
ords_prods_customers = ords_prods_flag.merge(df_customers, on = 'user_id')

In [27]:
# Apply function to display all columns wihtin the dataframe
pd.set_option('display.max_columns', None)

In [28]:
# Check the output
ords_prods_customers.shape

(32399732, 33)

In [29]:
# Check the first 5 rows
ords_prods_customers.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price,spending_flag,median_order_day,order_freq_flag,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both,Mid-range product,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both,Mid-range product,Least busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [30]:
# Drop '_merge' column
ords_prods_customers = ords_prods_customers.drop(columns = ['_merge'])

In [31]:
# Check the output
ords_prods_customers.columns

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'busiest_day',
       'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_price', 'spending_flag', 'median_order_day', 'order_freq_flag',
       'first_name', 'last_name', 'gender', 'state', 'age', 'date_joined',
       'n_dependants', 'fam_status', 'income'],
      dtype='object')

## 6. Export merged dataframe as 'orders_products_customers_merged.pkl'

In [32]:
# Export ords_prods_merge in pkl format
ords_prods_customers.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customers_merged.pkl'))